In [3]:
import pandas as pd

In [4]:
dataset=pd.read_csv("aug_train.csv")

In [5]:
dataset.head(20)

,enrollee_id,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job,training_hours,target
0,8949,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,>20,NaN,NaN,1,36,1.0
1,29725,city_40,0.776,Male,No relevent experience,no_enrollment,Graduate,STEM,15,50-99,Pvt Ltd,>4,47,0.0
2,11561,city_21,0.624,NaN,No relevent experience,Full time course,Graduate,STEM,5,NaN,NaN,never,83,0.0
3,33241,city_115,0.789,NaN,No relevent experience,NaN,Graduate,Business Degree,<1,NaN,Pvt Ltd,never,52,1.0
4,666,city_162,0.767,Male,Has relevent experience,no_enrollment,Masters,STEM,>20,50-99,Funded Startup,4,8,0.0
5,21651,city_176,0.764,NaN,Has relevent experience,Part time course,Graduate,STEM,11,NaN,NaN,1,24,1.0
6,28806,city_160,0.920,Male,Has relevent experience,no_enrollment,High School,NaN,5,50-99,Funded Startup,1,24,0.0
7,402,city_46,0.762,Male,Has relevent experience,no_enrollment,Graduate,STEM,13,<10,Pvt Ltd,>4,18,1.0
8,27107,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,7,50-99,Pvt Ltd,1,46,1.0
9,699,city_103,0.920,NaN,Has relevent experience,no_enrollment,Graduate,STEM,17,10000+,Pvt Ltd,>4,123,0.0
10,29452,city_21,0.624,NaN,No relevent experience,Full time course,High School,NaN,2,NaN,NaN,never,32,1.0
11,23853,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,5,5000-9999,Pvt Ltd,1,108,0.0
12,25619,city_61,0.913,Male,Has relevent experience,no_enrollment,Graduate,STEM,>20,1000-4999,Pvt Ltd,3,23,0.0
13,5826,city_21,0.624,Male,No relevent experience,NaN,NaN,NaN,2,NaN,NaN,never,24,0.0
14,8722,city_21,0.624,NaN,No relevent experience,Full time course,High School,NaN,5,NaN,NaN,never,26,0.0
15,6588,city_114,0.926,Male,Has relevent experience,no_enrollment,Graduate,STEM,16,10/49,Pvt Ltd,>4,18,0.0
16,4167,city_103,0.920,NaN,Has relevent experience,no_enrollment,Graduate,STEM,1,50-99,Pvt Ltd,never,106,0.0
17,5764,city_21,0.624,NaN,Has relevent experience,no_enrollment,Graduate,STEM,2,5000-9999,Pvt Ltd,2,7,0.0
18,2156,city_21,0.624,NaN,Has relevent experience,no_enrollment,Graduate,STEM,7,10000+,Pvt Ltd,never,23,1.0
19,11399,city_13,0.827,Female,Has relevent experience,no_enrollment,Graduate,Arts,4,NaN,NaN,1,132,1.0

In [6]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 19158 entries, 0 to 19157
Data columns (total 14 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   enrollee_id             19158 non-null  int64
 1   city                    19158 non-null  object
 2   city_development_index  19158 non-null  float64
 3   gender                  14650 non-null  object
 4   relevent_experience     19158 non-null  object
 5   enrolled_university     18772 non-null  object
 6   education_level         18698 non-null  object
 7   major_discipline        16345 non-null  object
 8   experience              19093 non-null  object
 9   company_size            13220 non-null  object
 10  company_type            13018 non-null  object
 11  last_new_job            18735 non-null  object
 12  training_hours          19158 non-null  int64
 13  target                  19158 non-null  float64
dtypes: float64(2), int64(2), object(10)
memory usage: 2.0+ MB

In [7]:
dataset.describe()

        enrollee_id  city_development_index  training_hours        target
count  19158.000000            19158.000000    19158.000000  19158.000000
mean   16875.358179                0.828848       65.366896      0.249348
std     9616.292592                0.123362       60.058462      0.432647
min        1.000000                0.448000        1.000000      0.000000
25%     8554.250000                0.740000       23.000000      0.000000
50%    16982.500000                0.903000       47.000000      0.000000
75%    25169.750000                0.920000       88.000000      0.000000
max    33380.000000                0.949000      336.000000      1.000000

finding unique values in experience and last new job to make datatype new formate

In [86]:
exp=dataset["experience"].unique()
exp

array(['>20', '15', '5', '<1', '11', '13', '7', '17', '2', '16', '1', '4',
       '10', '14', '18', '19', '12', '3', '6', '9', '8', '20', nan],
      dtype=object)

In [87]:
In=dataset["last_new_job"].unique()
In

array(['1', '>4', 'never', '4', '3', '2', nan], dtype=object)

#replace

In [88]:
dataset["experience"]=dataset["experience"].replace({'>20':21,'<1':0})
dataset["last_new_job"]=dataset["last_new_job"].replace({'>4':5,'never':0})
dataset["experience"]
dataset["last_new_job"]

0        1
1        5
2        0
3        0
4        4
        ..
19153    1
19154    4
19155    4
19156    2
19157    1
Name: last_new_job, Length: 19158, dtype: object

###change to numeric

In [89]:
dataset["experience"]=pd.to_numeric(dataset["experience"],errors="coerce")
dataset["last_new_job"]=pd.to_numeric(dataset["last_new_job"],errors="coerce")

In [90]:
dataset.isnull().sum()

enrollee_id                  0
city                         0
city_development_index       0
gender                    4508
relevent_experience          0
enrolled_university        386
education_level            460
major_discipline          2813
experience                  65
company_size              5938
company_type              6140
last_new_job               423
training_hours               0
target                       0
dtype: int64

In [91]:
#1-what experience group is most likeely to look for new job
#2- which education level is most common among job seeker?
#3-do candidates with relavent experience,have more traning hours?
#4-what is the average experience (in years for each education level?(group by)
#5-which company type has the highest of people waiting to switch the job?

###handling null values

In [92]:
dataset["experience"].fillna(dataset["experience"].median(),inplace=True)

C:\Users\shalini maurya\AppData\Local\Temp\ipykernel_7228\2528366588.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  dataset["experience"].fillna(dataset["experience"].median(),inplace=True)

In [93]:
dataset["education_level"].fillna(dataset["education_level"].mode()[0],inplace=True)

C:\Users\shalini maurya\AppData\Local\Temp\ipykernel_7228\658771004.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  dataset["education_level"].fillna(dataset["education_level"].mode()[0],inplace=True)

In [101]:
dataset["company_type"].fillna("unknown",inplace=True)

C:\Users\shalini maurya\AppData\Local\Temp\ipykernel_7228\1376978165.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  dataset["company_type"].fillna("unknown",inplace=True)

In [95]:
dataset["enrolled_university"].fillna(dataset["enrolled_university"].mode()[0],inplace=True)

C:\Users\shalini maurya\AppData\Local\Temp\ipykernel_7228\1363202352.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  dataset["enrolled_university"].fillna(dataset["enrolled_university"].mode()[0],inplace=True)

In [96]:
dataset["gender"].value_counts()

gender
Male      13221
Female     1238
Other       191
Name: count, dtype: int64

In [102]:
dataset.isnull().sum()

enrollee_id                  0
city                         0
city_development_index       0
gender                       0
relevent_experience          0
enrolled_university          0
education_level              0
major_discipline          2813
experience                   0
company_size              5938
company_type                 0
last_new_job               423
training_hours               0
target                       0
dtype: int64

In [98]:
dataset["gender"]=dataset["gender"].fillna("unknown")

####question 1--what experience group is most likeely to look for new job?

In [103]:
import seaborn as sns
import matplotlib.pyplot as plt
import numpy as np

In [104]:
dataset.groupby("experience")["target"]

In [107]:
dataset.groupby("experience")["target"].mean()*100

experience
0.0     45.402299
1.0     42.440801
2.0     33.185448
3.0     35.302806
4.0     32.573058
5.0     28.811189
6.0     28.207237
7.0     29.474708
8.0     24.314214
9.0     22.583732
10.0    21.015228
11.0    22.740964
12.0    18.623482
13.0    19.298246
14.0    18.259386
15.0    16.618076
16.0    14.173228
17.0    16.666667
18.0    15.357143
19.0    17.434211
20.0    22.297297
21.0    15.307365
Name: target, dtype: float64

In [ ]:
##solution-every 45 out of 100 people  are 0 experience are looking for job

###ques2-which education level is most common among job seeker?

In [108]:
dataset[dataset["target"]==1]["education_level"].value_counts()

education_level
Graduate          3349
Masters            935
High School        394
Phd                 58
Primary School      41
Name: count, dtype: int64